{"modelTopology":{"class_name":"Functional","config":{"name":"model","layers":[{"name":"input_1","class_name":"InputLayer","config":{"batch_input_shape":[null,5,5,3],"dtype":"float32","sparse":false,"name":"input_1"},"inbound_nodes":[]},{"name":"input_2","class_name":"InputLayer","config":{"batch_input_shape":[null,5,5,3],"dtype":"float32","sparse":false,"name":"input_2"},"inbound_nodes":[]},{"name":"multi_conv2d","class_name":"MultiConv2D","config":{"name":"multi_conv2d","trainable":true,"filters":16,"kernel_size":[3,3],"padding":"same","strides":1,"use_bias":true,"kernel_initializer":{"class_name":"RandomNormal","config":{"mean":0,"stddev":0.05,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"activation":"relu"},"inbound_nodes":[[["input_1",0,0,{}],["input_2",0,0,{}]]]}],"input_layers":[["input_1",0,0],["input_2",0,0]],"output_layers":[["multi_conv2d",0,0],["multi_conv2d",0,1]]},"keras_version":"tfjs-layers 3.11.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"multi_conv2d/weights","shape":[2,3,3,3,16],"dtype":"float32"},{"name":"multi_conv2d/bias","shape":[2,16],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.11.0","convertedBy":null}